## Plan Result (sbox_shutter_webapp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;plumclassic&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;plumclassic&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["plumclassic"] must be replaced
-/+ resource "azurerm_dns_cname_record" "cname_record" {
      ~ fqdn                = "plumclassic-shutter.frontdoor.sandbox.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.platform.hmcts.net/CNAME/plumclassic-shutter" -> (known after apply)
      ~ name                = "plumclassic-shutter" -> "hmcts-sbox.azurefd.net-shutter" # forces replacement
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["plumclassic"] must be replaced
-/+ resource "azurerm_dns_txt_record" "zone_validate" {
      ~ fqdn                = "_dnsauth.frontdoor.sandbox.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.platform.hmcts.net/TXT/_dnsauth" -> (known after apply)
      ~ name                = "_dnsauth" -> "_dnsauth.hmcts-sbox.azurefd.net" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          + value = (known after apply)
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["plumclassic"] must be replaced
-/+ resource "azurerm_static_site_custom_domain" "custom_domain" {
      ~ domain_name      = "frontdoor.sandbox.platform.hmcts.net" -> "hmcts-sbox.azurefd.net" # forces replacement
      ~ id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-shutter-webapp-sbox-rg/providers/Microsoft.Web/staticSites/plumclassic/customDomains/frontdoor.sandbox.platform.hmcts.net" -> (known after apply)
      ~ validation_token = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1770,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp","Vars":{}} -->